Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H743/Includes/Registers/stm32H743_fdcan1.h
// RWD Configuration

#define FDCAN1_RWD_WDC          (0xFFU<<0)
#define FDCAN1_RWD_WDC_0        (0x1U<<0)
#define FDCAN1_RWD_WDV          (0xFFU<<8)
#define FDCAN1_RWD_WDV_0        (0x1U<<8)

// CCCR Configuration

#define FDCAN1_CCCR_NISO        (0x1U<<15)
#define FDCAN1_CCCR_TXP         (0x1U<<14)
#define FDCAN1_CCCR_EFBI        (0x1U<<13)
#define FDCAN1_CCCR_PXHD        (0x1U<<12)
#define FDCAN1_CCCR_BSE         (0x1U<<9)
#define FDCAN1_CCCR_FDOE        (0x1U<<8)
#define FDCAN1_CCCR_TEST        (0x1U<<7)
#define FDCAN1_CCCR_DAR         (0x1U<<6)
#define FDCAN1_CCCR_MON         (0x1U<<5)
#define FDCAN1_CCCR_CSR         (0x1U<<4)
#define FDCAN1_CCCR_CSA         (0x1U<<3)
#define FDCAN1_CCCR_ASM         (0x1U<<2)
#define FDCAN1_CCCR_CCE         (0x1U<<1)
#define FDCAN1_CCCR_INIT        (0x1U<<0)

// NBTP Configuration

#define FDCAN1_NBTP_TSEG2       (0x7FU<<0)
#define FDCAN1_NBTP_TSEG2_0     (0x1U<<0)
#define FDCAN1_NBTP_NTSEG1      (0xFFU<<8)
#define FDCAN1_NBTP_NTSEG1_0    (0x1U<<8)
#define FDCAN1_NBTP_NBRP        (0x1FFU<<16)
#define FDCAN1_NBTP_NBRP_0      (0x1U<<16)
#define FDCAN1_NBTP_NSJW        (0x7FU<<25)
#define FDCAN1_NBTP_NSJW_0      (0x1U<<25)

// TSCC Configuration

#define FDCAN1_TSCC_TSS         (0x3U<<0)
#define FDCAN1_TSCC_TSS_0       (0x1U<<0)
#define FDCAN1_TSCC_TCP         (0xFU<<16)
#define FDCAN1_TSCC_TCP_0       (0x1U<<16)

// TSCV Configuration

#define FDCAN1_TSCV_TSC         (0xFFFFU<<0)
#define FDCAN1_TSCV_TSC_0       (0x1U<<0)

// TOCC Configuration

#define FDCAN1_TOCC_TOP         (0xFFFFU<<16)
#define FDCAN1_TOCC_TOP_0       (0x1U<<16)
#define FDCAN1_TOCC_TOS         (0x3U<<1)
#define FDCAN1_TOCC_TOS_0       (0x1U<<1)
#define FDCAN1_TOCC_ETOC        (0x1U<<0)

// TOCV Configuration

#define FDCAN1_TOCV_TOC         (0xFFFFU<<0)
#define FDCAN1_TOCV_TOC_0       (0x1U<<0)

// ECR Configuration

#define FDCAN1_ECR_TEC          (0xFFU<<0)
#define FDCAN1_ECR_TEC_0        (0x1U<<0)
#define FDCAN1_ECR_TREC         (0x7FU<<8)
#define FDCAN1_ECR_TREC_0       (0x1U<<8)
#define FDCAN1_ECR_RP           (0x1U<<15)
#define FDCAN1_ECR_CEL          (0xFFU<<16)
#define FDCAN1_ECR_CEL_0        (0x1U<<16)

// PSR Configuration

#define FDCAN1_PSR_TDCV         (0x7FU<<16)
#define FDCAN1_PSR_TDCV_0       (0x1U<<16)
#define FDCAN1_PSR_PXE          (0x1U<<14)
#define FDCAN1_PSR_REDL         (0x1U<<13)
#define FDCAN1_PSR_RBRS         (0x1U<<12)
#define FDCAN1_PSR_RESI         (0x1U<<11)
#define FDCAN1_PSR_DLEC         (0x7U<<8)
#define FDCAN1_PSR_DLEC_0       (0x1U<<8)
#define FDCAN1_PSR_BO           (0x1U<<7)
#define FDCAN1_PSR_EW           (0x1U<<6)
#define FDCAN1_PSR_EP           (0x1U<<5)
#define FDCAN1_PSR_ACT          (0x3U<<3)
#define FDCAN1_PSR_ACT_0        (0x1U<<3)
#define FDCAN1_PSR_LEC          (0x7U<<0)
#define FDCAN1_PSR_LEC_0        (0x1U<<0)

// TDCR Configuration

#define FDCAN1_TDCR_TDCO        (0x7FU<<8)
#define FDCAN1_TDCR_TDCO_0      (0x1U<<8)
#define FDCAN1_TDCR_TDCF        (0x7FU<<0)
#define FDCAN1_TDCR_TDCF_0      (0x1U<<0)

// IR Configuration

#define FDCAN1_IR_ARA           (0x1U<<29)
#define FDCAN1_IR_PED           (0x1U<<28)
#define FDCAN1_IR_PEA           (0x1U<<27)
#define FDCAN1_IR_WDI           (0x1U<<26)
#define FDCAN1_IR_BO            (0x1U<<25)
#define FDCAN1_IR_EW            (0x1U<<24)
#define FDCAN1_IR_EP            (0x1U<<23)
#define FDCAN1_IR_ELO           (0x1U<<22)
#define FDCAN1_IR_DRX           (0x1U<<19)
#define FDCAN1_IR_TOO           (0x1U<<18)
#define FDCAN1_IR_MRAF          (0x1U<<17)
#define FDCAN1_IR_TSW           (0x1U<<16)
#define FDCAN1_IR_TEFL          (0x1U<<15)
#define FDCAN1_IR_TEFF          (0x1U<<14)
#define FDCAN1_IR_TEFW          (0x1U<<13)
#define FDCAN1_IR_TEFN          (0x1U<<12)
#define FDCAN1_IR_TEF           (0x1U<<11)
#define FDCAN1_IR_TCF           (0x1U<<10)
#define FDCAN1_IR_TC            (0x1U<<9)
#define FDCAN1_IR_HPM           (0x1U<<8)
#define FDCAN1_IR_RF1L          (0x1U<<7)
#define FDCAN1_IR_RF1F          (0x1U<<6)
#define FDCAN1_IR_RF1W          (0x1U<<5)
#define FDCAN1_IR_RF1N          (0x1U<<4)
#define FDCAN1_IR_RF0L          (0x1U<<3)
#define FDCAN1_IR_RF0F          (0x1U<<2)
#define FDCAN1_IR_RF0W          (0x1U<<1)
#define FDCAN1_IR_RF0N          (0x1U<<0)

// IE Configuration

#define FDCAN1_IE_ARAE          (0x1U<<29)
#define FDCAN1_IE_PEDE          (0x1U<<28)
#define FDCAN1_IE_PEAE          (0x1U<<27)
#define FDCAN1_IE_WDIE          (0x1U<<26)
#define FDCAN1_IE_BOE           (0x1U<<25)
#define FDCAN1_IE_EWE           (0x1U<<24)
#define FDCAN1_IE_EPE           (0x1U<<23)
#define FDCAN1_IE_ELOE          (0x1U<<22)
#define FDCAN1_IE_BEUE          (0x1U<<21)
#define FDCAN1_IE_BECE          (0x1U<<20)
#define FDCAN1_IE_DRXE          (0x1U<<19)
#define FDCAN1_IE_TOOE          (0x1U<<18)
#define FDCAN1_IE_MRAFE         (0x1U<<17)
#define FDCAN1_IE_TSWE          (0x1U<<16)
#define FDCAN1_IE_TEFLE         (0x1U<<15)
#define FDCAN1_IE_TEFFE         (0x1U<<14)
#define FDCAN1_IE_TEFWE         (0x1U<<13)
#define FDCAN1_IE_TEFNE         (0x1U<<12)
#define FDCAN1_IE_TEFE          (0x1U<<11)
#define FDCAN1_IE_TCFE          (0x1U<<10)
#define FDCAN1_IE_TCE           (0x1U<<9)
#define FDCAN1_IE_HPME          (0x1U<<8)
#define FDCAN1_IE_RF1LE         (0x1U<<7)
#define FDCAN1_IE_RF1FE         (0x1U<<6)
#define FDCAN1_IE_RF1WE         (0x1U<<5)
#define FDCAN1_IE_RF1NE         (0x1U<<4)
#define FDCAN1_IE_RF0LE         (0x1U<<3)
#define FDCAN1_IE_RF0FE         (0x1U<<2)
#define FDCAN1_IE_RF0WE         (0x1U<<1)
#define FDCAN1_IE_RF0NE         (0x1U<<0)

// ILS Configuration

#define FDCAN1_ILS_ARAL         (0x1U<<29)
#define FDCAN1_ILS_PEDL         (0x1U<<28)
#define FDCAN1_ILS_PEAL         (0x1U<<27)
#define FDCAN1_ILS_WDIL         (0x1U<<26)
#define FDCAN1_ILS_BOL          (0x1U<<25)
#define FDCAN1_ILS_EWL          (0x1U<<24)
#define FDCAN1_ILS_EPL          (0x1U<<23)
#define FDCAN1_ILS_ELOL         (0x1U<<22)
#define FDCAN1_ILS_BEUL         (0x1U<<21)
#define FDCAN1_ILS_BECL         (0x1U<<20)
#define FDCAN1_ILS_DRXL         (0x1U<<19)
#define FDCAN1_ILS_TOOL         (0x1U<<18)
#define FDCAN1_ILS_MRAFL        (0x1U<<17)
#define FDCAN1_ILS_TSWL         (0x1U<<16)
#define FDCAN1_ILS_TEFLL        (0x1U<<15)
#define FDCAN1_ILS_TEFFL        (0x1U<<14)
#define FDCAN1_ILS_TEFWL        (0x1U<<13)
#define FDCAN1_ILS_TEFNL        (0x1U<<12)
#define FDCAN1_ILS_TEFL         (0x1U<<11)
#define FDCAN1_ILS_TCFL         (0x1U<<10)
#define FDCAN1_ILS_TCL          (0x1U<<9)
#define FDCAN1_ILS_HPML         (0x1U<<8)
#define FDCAN1_ILS_RF1LL        (0x1U<<7)
#define FDCAN1_ILS_RF1FL        (0x1U<<6)
#define FDCAN1_ILS_RF1WL        (0x1U<<5)
#define FDCAN1_ILS_RF1NL        (0x1U<<4)
#define FDCAN1_ILS_RF0LL        (0x1U<<3)
#define FDCAN1_ILS_RF0FL        (0x1U<<2)
#define FDCAN1_ILS_RF0WL        (0x1U<<1)
#define FDCAN1_ILS_RF0NL        (0x1U<<0)

