Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H743/Includes/Registers/stm32H743_fdcan1.h
// TTILS Configuration

#define FDCAN1_TTILS_CERL       (0x1U<<18)
#define FDCAN1_TTILS_AWL        (0x1U<<17)
#define FDCAN1_TTILS_WTL        (0x1U<<16)
#define FDCAN1_TTILS_IWTGL      (0x1U<<15)
#define FDCAN1_TTILS_ELCL       (0x1U<<14)
#define FDCAN1_TTILS_SE2L       (0x1U<<13)
#define FDCAN1_TTILS_SE1L       (0x1U<<12)
#define FDCAN1_TTILS_TXOL       (0x1U<<11)
#define FDCAN1_TTILS_TXUL       (0x1U<<10)
#define FDCAN1_TTILS_GTEL       (0x1U<<9)
#define FDCAN1_TTILS_GTDL       (0x1U<<8)
#define FDCAN1_TTILS_GTWL       (0x1U<<7)
#define FDCAN1_TTILS_SWEL       (0x1U<<6)
#define FDCAN1_TTILS_TTMIL      (0x1U<<5)
#define FDCAN1_TTILS_RTMIL      (0x1U<<4)
#define FDCAN1_TTILS_SOGL       (0x1U<<3)
#define FDCAN1_TTILS_CSML       (0x1U<<2)
#define FDCAN1_TTILS_SMCL       (0x1U<<1)
#define FDCAN1_TTILS_SBCL       (0x1U<<0)

// TTOST Configuration

#define FDCAN1_TTOST_SPL        (0x1U<<31)
#define FDCAN1_TTOST_WECS       (0x1U<<30)
#define FDCAN1_TTOST_AWE        (0x1U<<29)
#define FDCAN1_TTOST_WFE        (0x1U<<28)
#define FDCAN1_TTOST_GSI        (0x1U<<27)
#define FDCAN1_TTOST_TMP        (0x7U<<24)
#define FDCAN1_TTOST_TMP_0      (0x1U<<24)
#define FDCAN1_TTOST_GFI        (0x1U<<23)
#define FDCAN1_TTOST_WGTD       (0x1U<<22)
#define FDCAN1_TTOST_RTO        (0xFFU<<8)
#define FDCAN1_TTOST_RTO_0      (0x1U<<8)
#define FDCAN1_TTOST_QCS        (0x1U<<7)
#define FDCAN1_TTOST_GTP        (0x1U<<6)
#define FDCAN1_TTOST_SYS        (0x3U<<4)
#define FDCAN1_TTOST_SYS_0      (0x1U<<4)
#define FDCAN1_TTOST_MS         (0x3U<<2)
#define FDCAN1_TTOST_MS_0       (0x1U<<2)
#define FDCAN1_TTOST_EL         (0x3U<<0)
#define FDCAN1_TTOST_EL_0       (0x1U<<0)

// TURNA Configuration

#define FDCAN1_TURNA_NAV        (0x3FFFFU<<0)
#define FDCAN1_TURNA_NAV_0      (0x1U<<0)

// TTLGT Configuration

#define FDCAN1_TTLGT_GT         (0xFFFFU<<16)
#define FDCAN1_TTLGT_GT_0       (0x1U<<16)
#define FDCAN1_TTLGT_LT         (0xFFFFU<<0)
#define FDCAN1_TTLGT_LT_0       (0x1U<<0)

// TTCTC Configuration

#define FDCAN1_TTCTC_CC         (0x3FU<<16)
#define FDCAN1_TTCTC_CC_0       (0x1U<<16)
#define FDCAN1_TTCTC_CT         (0xFFFFU<<0)
#define FDCAN1_TTCTC_CT_0       (0x1U<<0)

// TTCPT Configuration

#define FDCAN1_TTCPT_SWV        (0xFFFFU<<16)
#define FDCAN1_TTCPT_SWV_0      (0x1U<<16)
#define FDCAN1_TTCPT_CT         (0x3FU<<0)
#define FDCAN1_TTCPT_CT_0       (0x1U<<0)

// TTCSM Configuration

#define FDCAN1_TTCSM_CSM        (0xFFFFU<<0)
#define FDCAN1_TTCSM_CSM_0      (0x1U<<0)

// TTTS Configuration

#define FDCAN1_TTTS_EVTSEL      (0x3U<<4)
#define FDCAN1_TTTS_EVTSEL_0    (0x1U<<4)
#define FDCAN1_TTTS_SWTDEL      (0x3U<<0)
#define FDCAN1_TTTS_SWTDEL_0    (0x1U<<0)
